function simplePromise() {
    new Promise ((resolve) => {
        setTimeout(()=> resolve("Success!"),2000);
    }).then(console.log);
}
// Създава се нов промис чрез ключовата дума new Promise.
// Конструкторът на промиса приема функция с един аргумент, наречен resolve, който е функция, която се извиква, когато операцията е успешно завършена.
// В този случай, функцията използва setTimeout, за да изчака 2 секунди, преди да извика resolve с аргумент "Success!".
// След това, се добавя метод .then, който се извиква, когато промисът бъде резолвнат успешно. then приема функция като аргумент, която ще бъде изпълнена с резултата от resolve.
// В този случай, console.log се подава като аргумент на .then, така че, когато промисът бъде резолвнат успешно, резултатът "Success!" ще бъде изведен в конзолата.
// Така функцията simplePromise създава промис, който след 2 секунди връща "Success!", и след това изпълнява console.log с този резултат.